list2d = [[10, 15, 25, 20, 30],
          [52, 11, 17, 63, 25],
          [14, 28, 10, 10, 17]]
p1 = -1
p2 = 0

for i in range(3):  #3 строки
    for j in range(5):  #5 столбцов
        if (list2d[i][j] % 17 == 0):
            if (p1 == -1):
                p1 = i
                p2 = j
                break #ПРЕРЫВАЕМ
    if (p1 != 1):
        break   #ПРЕРЫВАЕМ

if (p1 != -1):
    print(f"Индексы первого числа кратного 17 [{p1}][{p2}].")
else:
    print("Кратных 17 элементов нет.")

list2d = [[10, 15, 25, 20, 30],
          [52, 11, 17, 63, 25],
          [14, 28, 10, 10, 17]]

find = False
x = 0

while (x < len(list2d) and not find):
    y = 0
    while (y < len(list2d[x]) and not find):
        if (list2d[x][y] % 17 == 0):
            find = True
        #Не забываем увеличивать y во внутреннем цикле
        y += 1
    #Не забываем увеличивать x во внешнем цикле
    x += 1

#Обязательно компенсируем -1, так как даже при
#Достижении find = True переменные x и y увеличиваются
#на единицу за счёт "последнего" прохода в цикле
x -= 1
y -=1

if (find):
    print(f"Индексы первого числа кратного 17 [{x}][{y}].")
else:
    print("Кратных 17 элементов нет.")